[
  {
    "metadata": {
      "title": "API Spec Q1, 10th Edition: Transition Training (Online Course)",
      "active": true,
      "description": "Please be advised that this training is nonrefundable and non-transferable. Once enrolled, the registration cannot be canceled, and the course cannot be transferred to another user.\nThis course is designed to assist the learner in understanding the changes, additions, and subtractions of requirements in the new 10th Ed of API Specification Q1, Quality Management System Requirements for Organizations Providing Products for the Petroleum and Natural Gas Industry. This self-paced, online course was written by API's leading authority of API Spec Q1, Dr. Edward Baniak. Included with the purchase of this self-paced, online course is a recording of a virtual, live session of the course conducted by Dr. Baniak.\nBy the end of this course, participants should be able to: Understand the changes to clauses from the 9th edition to the 10th edition, Understand the new clauses that have been developed for the 10th edition, and Identify requirements that have been subtracted from the 9th to the 10th edition.\nDr. Baniak is a Fellow and Lead Technical Investigator with the American Petroleum with over 43 years of experience in the Petroleum and Natural Gas Industry. He has been with the API for 24 years and has worked with the task group for API Q1 since his arrival at API at a time when companies were transitioning from the 5th to the 6th edition of the Q1 document. He initially represented the interests of the API Monogram Program concerning API Q1 matters and later was the secretary for Subcommittee 18, the group that has oversight of API Q1. Ed can claim to have attended every Q1 meeting during the development of the 7th, 8th, and 9th editions, and was the task group secretary for the revision to the 9th edition. In addition, Ed has Quality Management experience with operating laboratories conforming to ISO 9001, represented API at ISO TC176 (Quality Management and Quality Assurance), and has his lead auditor certification from the Institute for Quality Assurance (now the Chartered Quality Institute) from London, England. Ed has been performing both API staff and auditor observation/training to API Q1 for nearly 20 years.\nCertificate: A certificate of participation will be awarded to participants.",
      "productId": "2d77ccef-ca80-452c-afba-5519d2b085c4",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 6,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/d895f525-1977-4044-b85a-66e6f3d79b50/LMS-IMAGE-PLACER_350x234_SPEC-5L%20(0012).jpg",
      "status": "Current",
      "edition": "10",
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "2d77ccef-ca80-452c-afba-5519d2b085c4",
    "price": 650,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "June 28, Webinar: API Template 1.0 for GHG Reporting – Overview - On-Demand",
      "active": true,
      "description": "Following a comprehensive review of existing frameworks and deep engagement with member companies, API finalized a voluntary “Template 1.0 for GHG Reporting”, which was endorsed by the Executive Committee on June 9, 2021. Offering consistency, comparability, and clarity of information, the API Template 1.0 provides a core set of GHG indicators with standardized names, units, and definitions of the reporting boundaries, including across the value chain of the natural gas and oil industry.\nThis on-demand webinar includes an overview of the API Template 1.0 objective, orient API members to the Template, and provide guidance for its use.\nAdditional information:\nReporting to the API Template is voluntary. Key benefits include:\n- Enhances consistency and comparability across company-by-company climate-related reporting in the natural gas and oil industry\n- Enhances the industry’s ability to engage in policymaking and in capital markets by providing a core set of relevant information to stakeholders\n- Works as a complement to other climate-related reporting frameworks and takes into account relevant GHG reporting indicators from these frameworks\nThe API Template 1.0 draws from existing natural gas and oil company reporting practices, builds on the industry’s own existing guidance for reporting, and takes into account relevant recommended GHG reporting indicators from frameworks external to the natural gas and oil industry.",
      "productId": "88a656bb-3bed-46da-8079-3e64fe441f87",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 0.5,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/88a656bb-3bed-46da-8079-3e64fe441f87/GettyImages-1173733640.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "88a656bb-3bed-46da-8079-3e64fe441f87",
    "price": 120,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "API RP 510 & RP 572: Pressure Vessel Inspection Code and Practices Training (Instructor-Led Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 16 CPD hours.\nCourse Summary: This course is instructionally designed for novice inspectors, engineers, and other personnel who are starting, changing, or expanding their careers that want to be introduced to the API 510 Pressure Vessel Inspection & Repair Code and the inspection practices outlined in API RP 572. This is a live instructor-led course that is available virtually via Microsoft® Teams Meeting.\nAbout CASTI: Codes and Standards Training Institute (CASTI) has presented thousands of courses internationally, specializing in the area of engineering codes and standards (API, ASME, ASTM, CSA, NACE, ISO, and others). CASTI instructors are members of many codes and standards committees as well as globally-recognized professional engineers with international accreditations.\nCourse Inquiries: please contact CASTI at: www.casti.ca/contact_us\nHighlights:\n- Introduction to Pressure Vessels, including Towers\n- Reasons for Inspection\n- Owner/User Inspections Organization\n- Inspection, Examination, and Pressure Testing Practices\n- Safety Precautions and Preparatory Work\n- Inspection Methods, Limitations, and Pressure Tests\n- Inspection Data Evaluation, Analysis, and Recording: calculating minimum required thickness to retain pressure, corrosion rate, remaining life, MAWP, next inspection interval and due date\n- FFS Analysis and Evaluations of Corroded Regions\n- Introduction to Repairs, Alterations, and Rerating\n- Records and Reports\nOutcomes:\nAfter completing this course, participants will be able to:\n- apply the correct API standard pressure vessel inspection terminology;\n- identify pressure vessel inspection requirements and practices to assist with review and update of inspection plans;\n- assist with evaluating pressure vessel integrity to identify opportunities for inspection;\n- realize how to identify safety risks for pressure vessel inspection including preparatory work, inspection methods, and inspection tools required; and\n- recall the requirements for inspection record-keeping;\n- have an awareness of how to apply API 510 Code requirements and API RP 572 inspection practices and their limitations of inspection for pressure vessels.\nWho Should Attend:\nThis course is instructionally designed for novice inspectors, QA/QC personnel, engineers, tradespeople, and others who are starting, changing, or expanding their careers, working for plant owners, pressure equipment manufactures and repair organizations, engineering procurement and construction companies in oil and gas industries (oilfield, upgraders, refineries, etc.), chemical plants, petroleum refining, petrochemical plants, power plants, pulp and paper plants, fertilizer plants, and others responsible for inspecting pressure vessels.",
      "productId": "f1a49455-d7f6-47df-aec0-769b7b56db8e",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Instructor-Led",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 16,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/f1a49455-d7f6-47df-aec0-769b7b56db8e/8f429e6f756e8570.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "f1a49455-d7f6-47df-aec0-769b7b56db8e",
    "price": 895,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "API RP 570 & RP 574: Piping Inspection Code and Practices Training (Instructor-Led Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 16 CPD hours.\nCourse Summary: This course is instructionally designed for novice inspectors, engineers, and other personnel who are starting, changing, or expanding their careers that want to be introduced to the API 570 Piping Inspection & Repair Code and the inspection practices outlined in API RP 574. This is a live instructor-led course that is available virtually via Microsoft® Teams Meeting.About CASTI: Codes and Standards Training Institute (CASTI) has presented thousands of courses internationally, specializing in the area of engineering codes and standards (API, ASME, ASTM, CSA, NACE, ISO, and others). CASTI instructors are members of many codes and standards committees as well as globally-recognized professional engineers with international accreditations.Course Inquiries: please contact CASTI at: www.casti.ca/contact_usHighlights:The following topics are covered as they relate to API 570 and RP 574:- Introduction to Plant Piping- Reasons for Inspection\n- Owner/User Inspections Organization- Inspection, Examination, and Pressure Testing Practices Safety Precautions and Preparatory Work- Inspection Methods, Limitations, and Pressure Tests- Inspection Data Evaluation, Analysis, and Recording: calculating minimum required thickness to retain pressure, corrosion rate, remaining life, MAWP, next inspection interval and due date- Introduction to Repairs, Alterations, and Rerating- Records and Reports. Outcomes:After completing this course, participants will be able to:- apply the correct API standard pining inspection terminology;- identify piping inspection requirements and practices to assist with review and update of inspection plans;\n- assist with evaluating piping integrity to identify opportunities for inspection;- realize how to identify safety risks for piping inspection including preparatory work, inspection methods, and inspection tools required; and\n- recall the requirements for inspection record-keeping;\n- have an awareness of how to apply API 570 Code requirements and API RP 574 inspection practices and their limitations of inspection for piping.\nWho Should Attend:\nThis course is instructionally designed for novice inspectors, QA/QC personnel, engineers, tradespeople, and others who are starting, changing, or expanding their careers, working for plant owners, pressure equipment manufactures and repair organizations, engineering procurement and construction companies in oil and gas industries (oilfield, upgraders, refineries, etc.), chemical plants, petroleum refining, petrochemical plants, power plants, pulp and paper plants, fertilizer plants, and others responsible for inspecting piping.",
      "productId": "bede2ab0-df1e-46a7-b4fa-d4432bcf02d4",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Instructor-Led",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 16,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/bede2ab0-df1e-46a7-b4fa-d4432bcf02d4/caf01e47-b60b-4271-a9e0-7af72b1412ab1.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "bede2ab0-df1e-46a7-b4fa-d4432bcf02d4",
    "price": 895,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "API RP 572, 5th Edition: Introduction to Pressure Vessel Inspection Practices (Online Courses)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 8 CPD hours.\nCOURSE DEVELOPED AND PROVIDED BY CASTI\nCourse Description:\nThis course is instructionally designed for inspectors, engineers, and other personnel who want to learn more about the practice of pressure vessel inspection, as described in API Recommended Practice 572.\nLearning Outcomes:\nParticipants who successfully complete this course will be able to:\n- identify and apply API RP 572 standard pressure vessel inspection terminology;\n- analyze operational factors to effectively develop, review and update inspection plans;\n- recall the requirements for inspection record-keeping;\n- evaluate operational factors such as shutdowns to identify opportunities for inspection;\n- realize how to identify safety risks for pressure vessel inspection including preparatory work, inspection methods, and inspection tools required; and\n- understand how to identify and apply the limitations of inspection for a pressure vessel.\nOnline lessons are available for twelve months from the date of registration.",
      "productId": "cd3260a4-294c-44cb-8b33-e7d3ebda1d60",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/cd3260a4-294c-44cb-8b33-e7d3ebda1d60/572tile(6).png",
      "status": "Current",
      "edition": "5",
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "cd3260a4-294c-44cb-8b33-e7d3ebda1d60",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "API RP 576, 5th Edition: Introduction to Inspection of Pressure - Relieving Devices (Online Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 8 CPD hours.\nCOURSE DEVELOPED AND PROVIDED BY CASTI\nCourse Description:\nThis course is instructionally designed for inspectors, engineers, and other personnel who want to learn more about the practice of inspection of pressure-relieving devices, as described in API Recommended Practice 576.\nLearning Outcomes:\nParticipants who successfully complete this course will be able to:\n- identify and apply API RP 576 standard pressure-relieving device terminology;\n- list the common types of pressure-relieving devices, their applications, and how they work;\n- evaluate causes of improper pressure-relieving device performance;\n- explain the reasons for inspecting pressure-relieving devices;\n- understand the inspection and replacement of rupture disk devices;\n- describe the requirements for an on-stream visual inspection of pressure-relief valves;\n- discuss pressure-relieving device inspection frequency; and\n- recall reporting and record keeping requirements for pressure-relieving devices.\nOnline lessons are available for twelve months from the date of registration",
      "productId": "7b39387f-6969-42ab-b120-d3c658d04a3f",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/7b39387f-6969-42ab-b120-d3c658d04a3f/576tile(1).jpg",
      "status": "Current",
      "edition": "5",
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "7b39387f-6969-42ab-b120-d3c658d04a3f",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "API RP 577, 3rd Edition: Introduction to Welding Processes, Inspection, and Metallurgy for Inspectors (Online Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 8 CPD hours.\nCOURSE DEVELOPED AND PROVIDED BY CASTI\nCourse Description:\nThis course is instructionally designed for inspectors, engineers, and other personnel who want to learn more about welding processes, inspection, and metallurgy, as described in API Recommended Practice 577.\nLearning Outcomes:\nParticipants who successfully complete this course will be able to:\n- Identify and apply API RP 577 standard terminology;\n- Demonstrate the inspector tasks associated with welding inspection;\n- Describe the common welding processes including advantages and limitations of each process;\n- Explain how welding procedure specifications (WPS) and welder performance qualifications relate to ASME Section IX;\n- Define where common weld discontinuities are found during inspection;\n- List the nondestructive examination (NDE) methods commonly used during weld inspection;\n- Recall the reasons for preheating and postweld heat treating welds;\n- Explain how to assess the weldability of a variety of alloys; and\n- Outline common refinery and petrochemical plant welding issues.\nOnline lessons are available for twelve months from the date of registration",
      "productId": "26ba389e-f6e3-446a-9818-cd3fdcabaa0e",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/26ba389e-f6e3-446a-9818-cd3fdcabaa0e/577tile.jpg",
      "status": "Current",
      "edition": "3",
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "26ba389e-f6e3-446a-9818-cd3fdcabaa0e",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "API RP 653 & RP 575: Aboveground Storage Tank Inspection Code and Practices Training (Instructor-Led Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 16 CPD hours.\nCourse Summary: This course is instructionally designed for novice inspectors, engineers, and other personnel who are starting, changing, or expanding their careers that want to be introduced to the API 653 Aboveground Storage Tank Inspection & Repair Code and the inspection practices outlined in API RP 575. This is a live instructor-led course that is available virtually via Microsoft® Teams Meeting.\nAbout CASTI: Codes and Standards Training Institute (CASTI) has presented thousands of courses internationally, specializing in the area of engineering codes and standards (API, ASME, ASTM, CSA, NACE, ISO, and others). CASTI instructors are members of many codes and standards committees as well as globally-recognized professional engineers with international accreditations.\nCourse Inquiries: please contact CASTI at: www.casti.ca/contact_us\nHighlights:\nTopics covered related to API 653 and RP 575 for inspecting aboveground storage tanks include:\n- Introduction to Aboveground Storage Tanks\n- Reasons for Inspection\n- Owner/User Inspections Organization\n- Inspection, Examination, and Pressure Testing Practices\n- Safety Precautions and Preparatory Work\n- Inspection Methods, Limitations, and Pressure Tests\n- Inspection Data Evaluation, Analysis, and Recording: calculating minimum required thickness to retain pressure, corrosion rate, remaining life, next inspection interval and due date\n- Introduction to Repairs, Alterations, and Reconstruction\n- Records and Reports\nOutcomes:\nAfter completing this course, participants will be able to:\n- apply the correct API standard aboveground storage tank inspection terminology;\n- identify aboveground storage tank inspection requirements and practices to assist with review and update of inspection plans;\n- assist with evaluating aboveground storage tank integrity to identify opportunities for inspection;\n- realize how to identify safety risks for aboveground storage tank inspection including preparatory work, inspection methods, and inspection tools required; and\n- recall the requirements for inspection record-keeping;\n- have an awareness of how to apply API 653 Code requirements and API RP 575 inspection practices and their limitations of inspection for pressure vessels.\nWho Should Attend:\nThis course is instructionally designed for novice inspectors, QA/QC personnel, engineers, tradespeople, and others who are starting, changing, or expanding their careers, working for plant owners, pressure equipment manufactures and repair organizations, engineering procurement and construction companies in oil and gas industries (oilfield, upgraders, refineries, etc.), chemical plants, petroleum refining, petrochemical plants, power plants, pulp and paper plants, fertilizer plants, and others responsible for inspecting aboveground storage tanks.",
      "productId": "01e8b315-3d32-4446-b502-c5779ecdecc6",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Instructor-Led",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 16,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/01e8b315-3d32-4446-b502-c5779ecdecc6/Annotation%202024-01-09%20164005.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "01e8b315-3d32-4446-b502-c5779ecdecc6",
    "price": 895,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "ASME Section IX: Performance Qualification (Online Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 8 CPD hours.\nThis course was developed by CASTI\nThis three part course will introduce the learner to welding performance qualification (WPQ) based on requirements of ASME Code Section IX. Topics covered in this course include:\n- Welding General Requirements\n- Welder and Welding Operator Performance Qualification\n- Forms QW-484A and QW-484B\nFor further details about each module, please refer to the syllabus below.",
      "productId": "74d633a1-1d81-43cc-b2a1-5fc4c85bff59",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/74d633a1-1d81-43cc-b2a1-5fc4c85bff59/ASME.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "74d633a1-1d81-43cc-b2a1-5fc4c85bff59",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "ASME Section IX: Procedure Qualification (Online Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 8 CPD hours.\nThis course was developed by CASTI\nThis four-part course will introduce the learner to welding procedure qualification (PQR) based on requirements of ASME Code Section IX. Topics covered in this course include:\n- Welding General Requirements\n- Welding Procedure Requirements\n- WPS Qualification: Mechanical Testing\n- Forms QW-482 and QW-483 SMAW of P-No. 1 welded to P-No. 1\nFor further details about each module, please refer to the syllabus below.",
      "productId": "d3ed85c2-f63c-4009-872b-c868bbf5e3db",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/d3ed85c2-f63c-4009-872b-c868bbf5e3db/ASME.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "d3ed85c2-f63c-4009-872b-c868bbf5e3db",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "ASME Section V: Introduction to NDE Basics (Online Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): After successfully completing this course, participants will receive a digital Certificate of Completion awarding 8 CPD hours.\nThis course is provided by CASTI\nCourse Description\nThis course is instructionally designed for inspectors, engineers, and other personnel who want to learn more about the \"more common\" nondestructive testing methods and requirements in ASME Section V (see Course Outline for details).\nLearning Outcomes\nParticipants who successfully complete this course will be able to:\n- identify and apply ASME Section V standard terminology;\n- recall the general procedure requirements for nondestructive testing;\n- describe the radiographic examination technique and reporting requirements;\n- describe the liquid penetrant examination technique and reporting requirements;\n- describe the magnetic particle examination technique and reporting requirements;\n- recall the significance of using the manual ultrasonic pulse-echo contact method.\nWho Should Attend\nThis e-learning course is designed for inspectors, QA/QC personnel, engineers, tradespeople, and others working for plant owners, pressure equipment manufactures and repair organizations, engineering procurement and construction companies in oil and gas industries (oilfield, upgraders, refineries, etc.), chemical plants, petroleum refining, petrochemical plants, power plants, pulp and paper plants, fertilizer plants, and others.\nCourse Outline\nThe following topics are covered in this course:\nIntroduction to Practical Nondestructive Testing Using ASME Section V\n- introduction to standard terminology based on ASME Section V\nProcedure Requirements\n- personnel\n- calibration\n- examinations and inspections\n- identifying and classifying NDE indications\n- evaluation\n- records and documentation\nRadiographic Examination - Article 2\n- procedure requirements\n- surface preparation\n- weld surface preparation, ripples and reinforcement\n- backscatter radiation, excessive backscatter\n- system of identification\n- contract, component, weld or weld seam, date\n- monitoring density limitations of radiographs\n- radiographic film, intensifying screens\n- image quality indicator (IQI) design\n- source size calibration\n- densitometer and step wedge comparison film calibration\n- radiographic technique, geometric unsharpness\n- location markers\n- IQI\n- selection of wire-type or hole-type\n- placement of IQIs for welds\n- sensitivity resolution sensitivity per weld thickness\n- single-wall and double-wall techniques for materials and welds\n- quality of radiographs\n- documentation and review\nLiquid Penetrant - Article 6\n- general\n- written procedure requirements\n- control of contaminants\n- surface preparation - removal of welding flux, welding spatter, paint, other contaminants\n- techniques for standard and nonstandard temperatures\n- technique restrictions\n- calibration\n- penetrant application, penetration (dwell) time, excess penetrant removal\n- developing\n- interpretation\n- evaluation, recording of indications\n- examination records\nMagnetic Particle Examination - Article 7\n- general, MT of surface weld cracks and orientation\n- written procedure requirements\n- examination medium\n- surface conditioning - as-welded, as-rolled, as-cast, as-forged\n- prod technique, yoke technique\n- frequency of calibration\n- preliminary examinations\n- method of examination\n- excess particle removal\n- interpretation\n- demagnetization\n- evaluation, recording of indications\n- examination records\nVisual Examination - Article 9\n- written procedure requirements\n- physical requirements\n- equipment\n- direct visual examination\n- remote visual examination\n- evaluation\n- report of examination\nLeak Testing - Article 10\n- written procedure requirements for any metal, nonmetal, welded component\n- gages\n- temperature requirements\n- pressure/vacuum requirements (pressure limits)\n- pressure/vacuum gage calibration\n- calibration leak standards\n- test reports\nMeasuring Thickness by Manual Ultrasonic Pulse-Echo Contact Method - Article 23, SE-797\n- significance and use\n- basis of application\n- apparatus\n- technical hazards",
      "productId": "c70c7b4e-365a-4d95-9b48-1c67a65cef46",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/c70c7b4e-365a-4d95-9b48-1c67a65cef46/shutterstock_124714090_thumbnail.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "c70c7b4e-365a-4d95-9b48-1c67a65cef46",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "ASTM Standards: Carbon & Alloy Steels (Online Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): Participants are eligible for 8 CPD hours after successfully completing this course.\nCourse Description\nThis virtual training course is designed for all individuals who work with steels. You will learn how carbon steels, low-alloy steels, and alloy steels are addressed in ASTM Standards, improving your ability to identify steels for a given application; and by using ASTM Standards, understand the technical requirements for each type of steel, as well as meaningfully evaluate supplied steel chemistry and mechanical properties. These new skills will improve your ability to identify the correct ASTM specification, grade, and their requirements when ordering steel products and reviewing material test reports (MTRs). These goals are achieved through the use of many Connecting-the-Standards© examples, including: ASTM product specifications, general requirements specifications, test methods, and terminology standards.\nLearning Outcomes\nAfter completing this virtual training course, using ASTM steel standards, you will be able to:\n- After completing this virtual training course, using ASTM steel standards, you will be able to:\n- compare and contrast the different types of ASTM standards and how they are applied to steels;\n- correctly classify steels as being a: carbon steel, low-alloy steel, or alloy steel as defined in ASTM standard terminology;\n- explain how ASTM carbon and alloy steel product specifications and grades are designated and how they differ from other steel designations like SAE and AISI;\n- navigate ASTM steel standards to identify mechanical and chemical requirements for carbon, low-alloy, and alloy steels and how these requirements may differ with varying product forms (e.g., plate, pipe, forging, etc.);\n- apply and evaluate mechanical properties requirements based on chemical composition of carbon, low-alloy, and alloy steels and how these requirements should be specified;\n- explain how the ASTM A370 standard for mechanical testing of steel products is used for carbon, low-alloy, and alloy steels;\n- describe common applications for carbon, low-alloy, and alloy steels; and\n- explain the roles of chemical elements in steels.\nWho Should Attend\nThis virtual training course is designed for all personnel involved with steels, such as, engineers, inspectors, QA/QC technicians, NDE examiners, purchasers, inventory control personnel, tradespeople, manufacturing and repair companies, engineering procurement companies, and others working in most industries that use steel, including: civil construction (buildings, bridges), pressure equipment, ship building, water treatment, pipelines, oil and gas industries (oilfield, upgraders, refineries, etc.), chemical plants, petroleum refining, petrochemical plants, power plants, pulp and paper plants, fertilizer plants, and many others.",
      "productId": "d895f525-1977-4044-b85a-66e6f3d79b50",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/d895f525-1977-4044-b85a-66e6f3d79b50/LMS-IMAGE-PLACER_350x234_SPEC-5L%20(0012).jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "d895f525-1977-4044-b85a-66e6f3d79b50",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  },
  {
    "metadata": {
      "title": "ASTM Standards: Making Steel Plate, Pipe, Shapes, & Forgings (Online Course)",
      "active": true,
      "description": "Continuing Professional Development (CPD): Participants are eligible for 8 CPD hours after successfully completing this course.\nCourse Description\nThis virtual training course is designed for all individuals who work with steels. You will learn how common steel wrought products, such as: rolled, forged, tubular, and wire products are made; and by using ASTM Standards improve your ability to understand how the product’s mechanical properties are developed through steelmaking practices, chemical composition, inclusion control, and forming methods. These new skills will improve your ability to identify the correct ASTM specification, grade, and their requirements when ordering steel products and reviewing material test reports (MTRs). These goals are achieved through the use of many Connecting-the-Standards© examples, including: ASTM product specifications, general requirements specifications, test methods, and terminology standards.\nLearning Outcomes\nParticipants will be able to:\n- recall how steel is made to produce wrought products;\n- identify and apply ASTM standard steel terminology for wrought steel products;\n- recall manufacturing methods for steel ingots and strand cast blooms, billets, and slabs, as used in ASTM Standards;\n- describe what a heat of steel, heat analysis, product analysis, and lot of steel are, as defined in ASTM Standards;\n- discuss steel refining practices such as inclusion control, rimmed, killed, and semikilled steels, and how these practices are used in ASTM Standards;\n- describe how rolled, forged, tubular, and wire steel products are made and how each unique product form is specified in ASTM Standards; and recall the anisotropic behavior of steels due the manufacturing direction of working and how this behavior affects the mechanical properties and testing of wrought steel products.\nWho Should Attend\nThis virtual training course is designed for all personnel involved with steels, such as, engineers, inspectors, QA/QC technicians, NDE examiners, purchasers, inventory control personnel, tradespeople, manufacturing and repair companies, engineering procurement companies, and others working in most industries that use steel, including: civil construction (buildings, bridges), pressure equipment, ship building, water treatment, pipelines, oil and gas industries (oilfield, upgraders, refineries, etc.), chemical plants, petroleum refining, petrochemical plants, power plants, pulp and paper plants, fertilizer plants, and many others.",
      "productId": "57e1a4ad-d11f-44e4-bea0-b22c576f55da",
      "productType": "Training",
      "trainingText": "TRAINING",
      "modality": "Self-Paced",
      "lob": "Training",
      "programs": ["Training"],
      "durationHours": 8,
      "thumbnailUrl": "https://d1vy0qa05cdjr5.cloudfront.net/c311ad6c-5dd5-40e1-be79-7a9dd756b926/Public/Courses/57e1a4ad-d11f-44e4-bea0-b22c576f55da/81748252-1.jpg",
      "status": "Current",
      "edition": null,
      "language": "English",
      "accountId": null,
      "rikOrderNumber": null
    },
    "productId": "57e1a4ad-d11f-44e4-bea0-b22c576f55da",
    "price": 395,
    "language": "English",
    "supportedLanguages": ["English"],
    "publishedPhase": "Published"
  }
]
